## Production: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 20 to add, 15 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                     NAME                                                      |
|--------|---------------------------------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.form_viewer_maintenance_mode`                                                            |
|        | `aws_acm_certificate_validation.form_viewer_maintenance_mode_cloudfront_certificate`                          |
|        | `aws_cloudfront_distribution.maintenance_mode`                                                                |
|        | `aws_cloudfront_origin_access_identity.maintenance_mode`                                                      |
|        | `aws_route53_record.form_viewer_maintenance[0]`                                                               |
|        | `aws_route53_record.form_viewer_maintenance_mode_certificate_validation[&quot;forms-formulaires.alpha.canada.ca&quot;]` |
|        | `aws_s3_bucket.maintenance_mode`                                                                              |
|        | `aws_s3_bucket_ownership_controls.maintenance_mode`                                                           |
|        | `aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3`                                        |
|        | `aws_s3_bucket_public_access_block.maintenance_mode`                                                          |
|        | `aws_s3_bucket_server_side_encryption_configuration.maintenance_mode`                                         |
|        | `aws_s3_bucket_website_configuration.maintenance_mode`                                                        |
|        | `aws_s3_object.maintenance_static_page_css_files[&quot;style.css&quot;]`                                                |
|        | `aws_s3_object.maintenance_static_page_html_files[&quot;index-fr.html&quot;]`                                           |
|        | `aws_s3_object.maintenance_static_page_html_files[&quot;index.html&quot;]`                                              |
|        | `aws_s3_object.maintenance_static_page_ico_files[&quot;favicon.ico&quot;]`                                              |
|        | `aws_s3_object.maintenance_static_page_svg_files[&quot;site-unavailable.svg&quot;]`                                     |
|        | `aws_wafv2_regex_pattern_set.cognito_login_paths`                                                             |
|        | `aws_wafv2_regex_pattern_set.valid_maintenance_mode_uri_paths`                                                |
|        | `aws_wafv2_web_acl.forms_maintenance_mode_acl`                                                                |
| delete | `aws_route53_record.form_viewer[1]`                                                                           |
|        | `aws_s3_bucket.firehose_waf_logs`                                                                             |
|        | `aws_s3_bucket_public_access_block.firehose_waf_logs`                                                         |
| update | `aws_acm_certificate.form_viewer`                                                                             |
|        | `aws_iam_role.firehose_waf_logs`                                                                              |
|        | `aws_kinesis_firehose_delivery_stream.firehose_waf_logs`                                                      |
|        | `aws_lb.form_viewer`                                                                                          |
|        | `aws_lb_listener.form_viewer_http`                                                                            |
|        | `aws_lb_listener.form_viewer_https`                                                                           |
|        | `aws_lb_target_group.form_viewer_1`                                                                           |
|        | `aws_lb_target_group.form_viewer_2`                                                                           |
|        | `aws_route53_record.form_viewer[0]`                                                                           |
|        | `aws_shield_protection.alb`                                                                                   |
|        | `aws_shield_protection.route53_hosted_zone[0]`                                                                |
|        | `aws_shield_protection.route53_hosted_zone[1]`                                                                |
|        | `aws_wafv2_regex_pattern_set.forms_base_url`                                                                  |
|        | `aws_wafv2_regex_pattern_set.valid_app_uri_paths`                                                             |
|        | `aws_wafv2_web_acl.forms_acl`                                                                                 |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/7617084619).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_cloudfront_to_access_static_website_in_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_to_access_static_website_in_s3" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_acm_certificate.form_viewer will be updated in-place
  ~ resource "aws_acm_certificate" "form_viewer" {
        id                        = "arn:aws:acm:ca-central-1:957818836222:certificate/71036e98-a054-4f6c-acf5-1024111a9af8"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate.form_viewer_maintenance_mode will be created
  + resource "aws_acm_certificate" "form_viewer_maintenance_mode" {
      + arn                       = (known after apply)
      + domain_name               = "forms-formulaires.alpha.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "forms-formulaires.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "forms-formulaires.alpha.canada.ca",
        ]
      + tags_all                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.form_viewer_maintenance_mode_cloudfront_certificate will be created
  + resource "aws_acm_certificate_validation" "form_viewer_maintenance_mode_cloudfront_certificate" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.maintenance_mode will be created
  + resource "aws_cloudfront_distribution" "maintenance_mode" {
      + aliases                         = [
          + "forms-formulaires.alpha.canada.ca",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = (known after apply)

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "MaintenanceMode"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "MaintenanceMode"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2019"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_identity.maintenance_mode will be created
  + resource "aws_cloudfront_origin_access_identity" "maintenance_mode" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Access Identity for the Maintenance Website"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # aws_iam_role.firehose_waf_logs will be updated in-place
  ~ resource "aws_iam_role" "firehose_waf_logs" {
        id                    = "firehose_waf_logs"
        name                  = "firehose_waf_logs"
      ~ tags                  = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose_waf_logs will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose_waf_logs" {
        id             = "arn:aws:firehose:ca-central-1:957818836222:deliverystream/aws-waf-logs-forms"
        name           = "aws-waf-logs-forms"
      ~ tags           = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb.form_viewer will be updated in-place
  ~ resource "aws_lb" "form_viewer" {
        id                                          = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:loadbalancer/app/form-viewer/ef2ad28d416e7d87"
        name                                        = "form-viewer"
      ~ tags                                        = {
          - "CostCentre" = "forms-platform-production" -> null
            "Name"       = "form_viewer"
          - "Terraform"  = "true" -> null
        }
        # (22 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lb_listener.form_viewer_http will be updated in-place
  ~ resource "aws_lb_listener" "form_viewer_http" {
        id                = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:listener/app/form-viewer/ef2ad28d416e7d87/5a5321156d4692bb"
      ~ tags              = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lb_listener.form_viewer_https will be updated in-place
  ~ resource "aws_lb_listener" "form_viewer_https" {
        id                = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:listener/app/form-viewer/ef2ad28d416e7d87/6cbbf9263c624fe9"
      ~ tags              = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb_target_group.form_viewer_1 will be updated in-place
  ~ resource "aws_lb_target_group" "form_viewer_1" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/form-viewer/8dac72758c8ecdcc"
        name                               = "form-viewer"
      ~ tags                               = {
          - "CostCentre" = "forms-platform-production" -> null
            "Name"       = "form_viewer_1"
          - "Terraform"  = "true" -> null
        }
        # (16 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "301,200" -> "200"
            # (8 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb_target_group.form_viewer_2 will be updated in-place
  ~ resource "aws_lb_target_group" "form_viewer_2" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/form-viewer-2/a03ac97959b5fb63"
        name                               = "form-viewer-2"
      ~ tags                               = {
          - "CostCentre" = "forms-platform-production" -> null
            "Name"       = "form_viewer_2"
          - "Terraform"  = "true" -> null
        }
        # (16 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "301,200" -> "200"
            # (8 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_route53_record.form_viewer[0] will be updated in-place
  ~ resource "aws_route53_record" "form_viewer" {
        id                               = "Z1031499PBK3926Y7HKK_forms-formulaires.alpha.canada.ca_A"
        name                             = "forms-formulaires.alpha.canada.ca"
      + set_identifier                   = "form_viewer_forms-formulaires.alpha.canada.ca_primary"
        # (6 unchanged attributes hidden)

      + failover_routing_policy {
          + type = "PRIMARY"
        }

        # (1 unchanged block hidden)
    }

  # aws_route53_record.form_viewer[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route53_record" "form_viewer" {
      - fqdn                             = "forms-formulaires.canada.ca" -> null
      - id                               = "Z0774184336K3QX9DUJ7E_forms-formulaires.canada.ca_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "forms-formulaires.canada.ca" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z0774184336K3QX9DUJ7E" -> null

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "form-viewer-1039776084.ca-central-1.elb.amazonaws.com" -> null
          - zone_id                = "ZQSVJUPU6J1EY" -> null
        }
    }

  # aws_route53_record.form_viewer_maintenance[0] will be created
  + resource "aws_route53_record" "form_viewer_maintenance" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "forms-formulaires.alpha.canada.ca"
      + set_identifier  = "form_viewer_forms-formulaires.alpha.canada.ca_secondary"
      + type            = "A"
      + zone_id         = "Z1031499PBK3926Y7HKK"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }

      + failover_routing_policy {
          + type = "SECONDARY"
        }
    }

  # aws_route53_record.form_viewer_maintenance_mode_certificate_validation["forms-formulaires.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "form_viewer_maintenance_mode_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z1031499PBK3926Y7HKK"
    }

  # aws_s3_bucket.firehose_waf_logs will be destroyed
  # (because aws_s3_bucket.firehose_waf_logs is not in configuration)
  - resource "aws_s3_bucket" "firehose_waf_logs" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::forms-waf-logs" -> null
      - bucket                      = "forms-waf-logs" -> null
      - bucket_domain_name          = "forms-waf-logs.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "forms-waf-logs.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "forms-waf-logs" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null

      - grant {
          - id          = "9a5058ac2253284c428c54c019d006666ef3eb73e380322b05c715157b6c384a" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "tf-s3-lifecycle-20211122163203859500000001" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 90 -> null
              - expired_object_delete_marker = false -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.maintenance_mode will be created
  + resource "aws_s3_bucket" "maintenance_mode" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "gc-forms-production-application-maintenance-page"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.maintenance_mode will be created
  + resource "aws_s3_bucket_ownership_controls" "maintenance_mode" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3 will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_to_access_static_website_in_s3" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.firehose_waf_logs will be destroyed
  # (because aws_s3_bucket_public_access_block.firehose_waf_logs is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "firehose_waf_logs" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "forms-waf-logs" -> null
      - id                      = "forms-waf-logs" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.maintenance_mode will be created
  + resource "aws_s3_bucket_public_access_block" "maintenance_mode" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "maintenance_mode" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_website_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_website_configuration" "maintenance_mode" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # aws_s3_object.maintenance_static_page_css_files["style.css"] will be created
  + resource "aws_s3_object" "maintenance_static_page_css_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = "92fa1c75f720e83330756f94b06aa8bf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "style.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/style.css"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_html_files["index-fr.html"] will be created
  + resource "aws_s3_object" "maintenance_static_page_html_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "5c195ef016b9e898437a543aba2301ac"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index-fr.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/index-fr.html"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_html_files["index.html"] will be created
  + resource "aws_s3_object" "maintenance_static_page_html_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "f15e6aa2fd75c9b6b97d93d2b1fedfbd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/index.html"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_ico_files["favicon.ico"] will be created
  + resource "aws_s3_object" "maintenance_static_page_ico_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "58bd7822fbbd5642104beae2b25a1b5b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.maintenance_static_page_svg_files["site-unavailable.svg"] will be created
  + resource "aws_s3_object" "maintenance_static_page_svg_files" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "1d263a8e324e88ea09c9b630de277c45"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "site-unavailable.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/site-unavailable.svg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_shield_protection.alb will be updated in-place
  ~ resource "aws_shield_protection" "alb" {
        id           = "226e4196-5d94-447d-a43b-ed55167f7abb"
        name         = "LoadBalancer"
      ~ tags         = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # aws_shield_protection.route53_hosted_zone[0] will be updated in-place
  ~ resource "aws_shield_protection" "route53_hosted_zone" {
        id           = "abb8c7ef-5e58-4b87-afe6-2eeb93734f51"
        name         = "Route53HostedZone"
      ~ tags         = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # aws_shield_protection.route53_hosted_zone[1] will be updated in-place
  ~ resource "aws_shield_protection" "route53_hosted_zone" {
        id           = "d363bd65-e6a1-4084-82d7-42fc99c81ad5"
        name         = "Route53HostedZone"
      ~ tags         = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # aws_wafv2_regex_pattern_set.cognito_login_paths will be created
  + resource "aws_wafv2_regex_pattern_set" "cognito_login_paths" {
      + arn         = (known after apply)
      + description = "Regex to match the login URIs"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "cognito_login_paths"
      + scope       = "REGIONAL"
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }

      + regular_expression {
          + regex_string = "^\\/(api\\/auth\\/(signin|callback)\\/cognito)$"
        }
    }

  # aws_wafv2_regex_pattern_set.forms_base_url will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "forms_base_url" {
        id          = "e1ceb832-c7e4-4b53-a818-44a55e27b3e4"
        name        = "forms_base_url"
        tags        = {}
      ~ tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)

      - regular_expression {
          - regex_string = "^forms-formulaires.canada.ca$" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_wafv2_regex_pattern_set.valid_app_uri_paths will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "valid_app_uri_paths" {
        id          = "f3927a12-2101-47c6-9a47-7353ac95ba92"
        name        = "valid_app_uri_paths"
        tags        = {}
      ~ tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_wafv2_regex_pattern_set.valid_maintenance_mode_uri_paths will be created
  + resource "aws_wafv2_regex_pattern_set" "valid_maintenance_mode_uri_paths" {
      + arn         = (known after apply)
      + description = "Regex to match the maintenance page valid URIs"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "valid_maintenance_page_uri_paths"
      + scope       = "CLOUDFRONT"
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }

      + regular_expression {
          + regex_string = "^\\/(index.html|index-fr.html|style.css|site-unavailable.svg|favicon.ico)?$"
        }
    }

  # aws_wafv2_web_acl.forms_acl will be updated in-place
  ~ resource "aws_wafv2_web_acl" "forms_acl" {
        id            = "88f61111-f91e-442b-9a19-c57c4f43ef7a"
        name          = "GCForms"
      ~ tags          = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (6 unchanged attributes hidden)

      - rule {
          - name     =...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.form_viewer_maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.form_viewer_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.form_viewer_https"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.form_viewer_1"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.form_viewer_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.maintenance_mode"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_css_files[\"style.css\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_html_files[\"index-fr.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_html_files[\"index.html\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_ico_files[\"favicon.ico\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.maintenance_static_page_svg_files[\"site-unavailable.svg\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.alb"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.route53_hosted_zone[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.route53_hosted_zone[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.cognito_login_paths"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
